/******************************************************************************/
/* src/i8042.h                                                                */
/*                                                                 2018/09/26 */
/* Copyright (C) 2018 Mochi.                                                  */
/******************************************************************************/
#ifndef I8042_H
#define I8042_H
/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/* ポート番号 */
#define I8042_PORT_INPUT    ( 0x60 )    /** 入力バッファレジスタ(データ用)   */
#define I8042_PORT_OUTPUT   ( 0x60 )    /** 出力バッファレジスタ             */
#define I8042_PORT_STATUS   ( 0x64 )    /** ステータスレジスタ               */
#define I8042_PORT_COMMAND  ( 0x64 )    /** 入力バッファレジスタ(コマンド用) */

/* ステータスレジスタビット */
#define I8042_STATUS_OBF    ( 0x01 )    /** OBF(Output Buffer Full) */
#define I8042_STATUS_IBF    ( 0x02 )    /** IBF(Input Buffer Full)  */


/******************************************************************************/
#endif
