/******************************************************************************/
/* src/main.c                                                                 */
/*                                                                 2018/09/26 */
/* Copyright (C) 2018 Mochi.                                                  */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 共通ヘッダ */
#include <mterm.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <kernel/library.h>

/* モジュールヘッダ */
#include "i8042.h"
#include "Proc.h"


/******************************************************************************/
/* ローカル関数定義                                                           */
/******************************************************************************/
void main( void )
{
    int32_t ret;    /* 戻り値 */
    
    /* 変数初期化 */
    ret = MK_INT_RET_FAILURE;
    
    /* モジュール初期化 */
    ProcInit();
    
    /* キーボードコントローラ割込み割当て */
    ret = MkIntStartMonitoring( I8259A_IRQ1, NULL );
    
    /* 割当て結果判定 */
    if ( ret != MK_INT_RET_SUCCESS ) {
        /* 失敗 */
        
        /* [TODO]アボート */
        *( ( uint32_t * ) NULL ) = 0xDEADDEAD;
    }
    
    /* キーボードコントローラ割込み有効化 */
    ret = MkIntEnable( I8259A_IRQ1, NULL );
    
    /* 有効化結果判定 */
    if ( ret != MK_INT_RET_SUCCESS ) {
        /* 失敗 */
        
        /* [TODO]アボート */
        *( ( uint32_t * ) NULL ) = 0xDEADDEAD;
    }
    
    /* メインループ */
    while ( true ) {
        /* 割込み待ち合わせ */
        ret = MkIntWait( NULL, NULL );
        
        /* 待ち合わせ結果判定 */
        if ( ret != MK_INT_RET_SUCCESS ) {
            /* 失敗 */
            
            /* [TODO]アボート */
            *( ( uint32_t * ) NULL ) = 0xDEADDEAD;
        }
        
        /* 割込み処理 */
        ProcInterrupt();
        
        /* 割込み処理完了 */
        MkIntComplete( I8259A_IRQ1, NULL );
    }
}


/******************************************************************************/
