/******************************************************************************/
/* src/Proc.c                                                                 */
/*                                                                 2018/09/26 */
/* Copyright (C) 2018 Mochi.                                                  */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 共通ヘッダ */
#include <mterm.h>
#include <stdbool.h>
#include <string.h>
#include <kernel/library.h>

/* モジュールヘッダ */
#include "Ctrl.h"
#include "Proc.h"


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/* 状態 */
#define STATE_NORMAL ( 0 )  /** 通常スキャンコード出力状態   */
#define STATE_E0     ( 1 )  /** 拡張E0スキャンコード出力状態 */
#define STATE_E1     ( 2 )  /** 拡張E1スキャンコード出力状態 */


/******************************************************************************/
/* ローカル関数宣言                                                           */
/******************************************************************************/
/* データ処理（通常スキャンコード出力状態） */
void ProcDataNormal( void );

/* データ処理（拡張E0スキャンコード出力状態） */
void ProcDataE0( void );

/* データ処理（拡張E1スキャンコード出力状態） */
void ProcDataE1( void );


/******************************************************************************/
/* グローバル変数定義                                                         */
/******************************************************************************/
/* 処理状態 */
static uint32_t gState;

/* メッセージ */
static MtermMsgInput_t gMsg;

/* 読込インデックス */
static uint32_t gReadIdx;


/******************************************************************************/
/* グローバル関数定義                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       処理モジュール初期化
 * @details     処理モジュールが持つグローバル変数を初期化する。
 */
/******************************************************************************/
void ProcInit( void )
{
    /* 状態初期化 */
    gState = STATE_NORMAL;
    
    /* メッセージ初期化 */
    gMsg.header.funcId = MTERM_FUNC_INPUT;
    gMsg.header.length = 3;
    gMsg.data[ 0 ]     = 0;
    gMsg.data[ 1 ]     = 0;
    gMsg.data[ 2 ]     = 0;
    
    /* 読込インデックス初期化 */
    gReadIdx = 0;
    
    return;
}


/******************************************************************************/
/**
 * @brief       キーボード割込み処理
 * @details     キーボードコントローラから出力バッファを読み込み、状態毎の処理
 *              関数を起動する。
 */
/******************************************************************************/
void ProcInterrupt( void )
{
    bool    retBool;
    uint8_t data;
    
    while ( true ) {
        /* 出力バッファ読込 */
        retBool = CtrlReadOutput( &( gMsg.data[ gReadIdx ] ) );
        
        /* 読込結果判定 */
        if ( retBool == false ) {
            /* 空 */
            
            break;
        }
        
        /* 読込インデックス更新 */
        gReadIdx++;
        
        if ( gState == STATE_NORMAL ) {
            /* 通常スキャンコード出力状態 */
            
            ProcDataNormal();
            
        } else if ( gState == STATE_E0 ) {
            /* 拡張E0スキャンコード出力状態 */
            
            ProcDataE0();
            
        } else if ( gState == STATE_E1 ) {
            /* 拡張E1スキャンコード出力状態 */
            
            ProcDataE1();
        }
    }
    
    return;
}


/******************************************************************************/
/* ローカル関数定義                                                           */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       データ処理（通常スキャンコード出力状態）
 * @details     スキャンコードが0xE0または0xE1の場合は各々の状態に遷移し、それ
 *              以外の場合はターミナルエミュレータmtermにスキャンコードを送信す
 *              る。
 */
/******************************************************************************/
void ProcDataNormal( void )
{
    /* スキャンコード判定 */
    if ( gMsg.data[ 0 ] == 0xE0 ) {
        /* 拡張E0スキャンコード */
        
        /* 状態遷移 */
        gState = STATE_E0;
        
    } else if ( gMsg.data[ 0 ] == 0xE1 ) {
        /* 拡張E1スキャンコード */
        
        /* 状態遷移 */
        gState = STATE_E1;
        
    } else {
        /* 通常スキャンコード */
        
        /* ターミナルエミュレータに転送 */
        MkMsgSend( 3, &gMsg, sizeof ( gMsg ), NULL );
        
        /* 初期化 */
        ProcInit();
    }
    
    return;
}


/******************************************************************************/
/**
 * @brief       データ処理（拡張E0スキャンコード出力状態）
 * @details     スキャンコードを2バイト取得できた場合はターミナルエミュレータ
 *              mtermにスキャンコードを送信し、状態などを初期化する。
 */
/******************************************************************************/
void ProcDataE0( void )
{
    /* コード数チェック */
    if ( gReadIdx == 2 ) {
        /* 完全 */
        
        /* ターミナルエミュレータに転送 */
        MkMsgSend( 3, &gMsg, sizeof ( gMsg ), NULL );
        
        /* 初期化 */
        ProcInit();
    }
    
    return;
}


/******************************************************************************/
/**
 * @brief       データ処理（拡張E1スキャンコード出力状態）
 * @details     スキャンコードを3バイト取得できた場合はターミナルエミュレータ
 *              mtermにスキャンコードを送信し、状態などを初期化する。
 */
/******************************************************************************/
void ProcDataE1( void )
{
    /* コード数チェック */
    if ( gReadIdx == 3 ) {
        /* 完全 */
        
        /* ターミナルエミュレータに転送 */
        MkMsgSend( 3, &gMsg, sizeof ( gMsg ), NULL );
        
        /* 初期化 */
        ProcInit();
    }
    
    return;
}


/******************************************************************************/
